Revit 2027 API
SpatialFieldManager.CurrentMeasurement Property
 Stores the currently displayed measurement
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CurrentMeasurement { get; set; }
Public Property CurrentMeasurement As Integer
	Get
	Set
public:
property int CurrentMeasurement {
	int get ();
	void set (int value);
}
member CurrentMeasurement : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: measurement is not in the range from 0 to (number of measurements - 1)
Remarks
 Must be in the range from 0 to (numberOfMeasurements - 1)
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace